%Очередная коллизия = индекс, тип, x, y, w, h;
%ТИП - столкновение при входе - 0 (защита объекта), при выходе - 1 (удерживание в объекте)
function Collisions = Collisions_Init(Collisions)
    if nargin < 1
        Collisions = [];
    end
     %Стены лазер
    Collisions{2} = [1 0 451 2179 11 126];
    Collisions{3} = [1 0 451 2179 540 33];
    Collisions{4} = [1 0 973 1562 19 650];
    Collisions{5} = [1 0 430 1549 555 106];
    Collisions{6} = [1 0 430 1420 14 129];
    Collisions{7} = [1 0 430 1420 521 28];
    Collisions{8} = [1 0 949 1169 20 252];
    Collisions{9} = [1 0 949 1170 146 32];
    Collisions{10} = [1 0 1079 1170 17 467];
    Collisions{11} = [1 0 1082 1598 232 331];
    Collisions{12} = [1 0 1067 1928 16 371];
    Collisions{13} = [1 0 1082 2266 533 33];
    Collisions{14} = [1 0 1600 1841 22 427];
    Collisions{15} = [1 0 1365 1597 251 333];
    Collisions{16} = [1 0 1602 928 18 669];
    Collisions{17} = [1 0 968 896 637 99];
    Collisions{18} = [1 0 949 921 19 83];
    Collisions{19} = [1 0 261 889 688 106];
    Collisions{20} = [1 0 260 957 19 1256];
    Collisions{21} = [1 0 277 2179 120 178];
    %Дверь входная
    Collisions{22} = [1 0 392 2244 61 69];
    %Двери лазера
    Collisions{23} = [1 0 275 1593 158 62];
    Collisions{24} = [1 0 955 942 7 227];
    %Зеркало на которое луч падает с реактора
    Collisions{25} = [1 0 631 1894 38 3];
    %Столбы с зеркалами, в порядке того как будет отражаться лазер
    Collisions{26} = [1 0 630 2018 39 24];
    Collisions{27} = [1 0 856 2017 39 24];
    Collisions{28} = [1 0 856 1740 39 24];
    Collisions{29} = [1 0 334 1740 39 24];
    Collisions{30} = [1 0 334 1323 39 24];
    Collisions{31} = [1 0 789 1323 39 24];
    Collisions{32} = [1 0 789 1198 39 24];
    Collisions{33} = [1 0 475 1198 39 24];
    Collisions{34} = [1 0 475 1058 39 24];
    Collisions{35} = [1 0 1489 1058 39 24];
    Collisions{36} = [1 0 1489 1250 39 24];
    Collisions{37} = [1 0 1381 1250 39 24];
    Collisions{38} = [1 0 1381 1137 39 24];
    Collisions{39} = [1 0 1258 1137 39 24];
    Collisions{40} = [1 0 1258 1492+19 39 24];
    %Дополнительные столбы
    Collisions{41} = [1 0 1381 1405 39 24];
    Collisions{42} = [1 0 1499 1405 39 24];
    Collisions{43} = [1 0 1146 1405 39 24];
    Collisions{44} = [1 0 1146 1199 39 24];
    %Зубастая дверь
    Collisions{45} = [1 0 1311 1631 57 37];
    %Алмаз
    Collisions{46} = [1 0 1493 1523 20 2];
    %Столбы возле звезды
    Collisions{47} = [1 0 1201 2020 22 1];
    Collisions{48} = [1 0 1125 2066 22 1];
    Collisions{49} = [1 0 1155 2139 22 1];
    Collisions{50} = [1 0 1246 2138 22 1];
    Collisions{51} = [1 0 1282 2061 22 1];
    %Холодильник
    %Стены
    Collisions{52} = [1 0 196 496 281 104];
    Collisions{53} = [1 0 463 167 11 332];
    Collisions{54} = [1 0 71 137 395 69];
    Collisions{55} = [1 0 71 206 3 293];
    Collisions{56} = [1 0 71 496 69 104];
    %Дверь
    Collisions{57} = [1 0 131 554 59 48];
    %Утварь
    Collisions{58} = [1 0 157 287 57 59];
    Collisions{59} = [1 0 267 287 58 128];
    Collisions{60} = [1 0 354 290 96 114];
    %Комната управления
    %Стены
    Collisions{61} = [1 0 1938 322 829 84];
    Collisions{62} = [1 0 1942 341 17 352];
    Collisions{63} = [1 0 1958 663 809 33];
    Collisions{64} = [1 0 2749 313 18 383];
    Collisions{65} = [1 0 2283 343 31 198];
    %Стол
    Collisions{66} = [1 0 2491 446 95 55];
    %Экран
    Collisions{67} = [1 0 2362 397 344 24];
    %Реактор
    %Стены
    Collisions{68} = [1 0 3524 252 218 59];
    Collisions{69} = [1 0 3526 247 15 153];
    %Collisions{70} = [1 0 3527 367 216 32]; %раньше мешала ходить
    Collisions{70} = [1 0 3527 386 216 32];
    Collisions{71} = [1 0 3743 386 235 43];
    Collisions{72} = [1 0 3938+16 296 40 90];
    Collisions{73} = [1 0 3742 237 237 59+15];
    %1000 дверей
    %Стены
    Collisions{74} = [1 0 1 2706 4219 96];
    Collisions{75} = [1 0 1 2801 18 103];
    Collisions{76} = [1 0 17 2880 4202 33];
    Collisions{77} = [1 0 4120 2721 17 160];
    %Вход + коридор
    %Стены
    Collisions{78} = [1 0 2219 1169 1813 104];
    Collisions{79} = [1 0 2001 1272 218 160];
    Collisions{80} = [1 0 1997 1433 18 189];
    Collisions{81} = [1 0 2066 1520 154 172];
    Collisions{82} = [1 0 2205 1681 284 615];
    Collisions{83} = [1 0 2490 2263 580 34];
    Collisions{84} = [1 0 3060 1976 18 295];
    Collisions{85} = [1 0 2553 1680 446 499];
    Collisions{86} = [1 0 2634 1360 243 322];
    Collisions{87} = [1 0 2943 1356 628 270];
    Collisions{88} = [1 0 3568 1593 78 134];
    Collisions{89} = [1 0 3708 1593 95 131];
    Collisions{90} = [1 0 3781 1356 309 270];
    Collisions{91} = [1 0 4087 1162 18 227];
    %Двери (с права налево)
    Collisions{92} = [1 0 4032 1168 59 29];
    Collisions{93} = [1 0 3647 1643 59 69];
    Collisions{94} = [1 0 2999 1975 58 29];
    Collisions{95} = [1 0 2881 1481 59 69];
    Collisions{96} = [1 0 2011 1612 59 69];
    %Комната с прожекваква
    %Стены
    Collisions{97} = [1 0 884 131 338 173];
    Collisions{98} = [1 0 884 304 18 323];
    Collisions{99} = [1 0 901 594 510 33];
    Collisions{100} = [1 0 1393 230 18 364];
    Collisions{101} = [1 0 1281 156 112 148];
    %Дверь
    Collisions{102} = [1 0 1222 226 59 28];
    %Стол
    Collisions{103} = [1 0 1011 397 84 97];
    %Рикардо
    Collisions{103} = [0 0 1212 411 80 80];
end